app/controllers/baytallies_controller.rb

	def index
		@baytallies = Baytally.all
---
SELECT "baytallies".* FROM "baytallies"