app/controllers/booking_controller.rb

	def choosebay
		@bay1 = User.where(date: Date.today, bay: 1).count
		@bay2 = User.where(date: Date.today, bay: 2).count
		@bay3 = User.where(date: Date.today, bay: 3).count
---
SELECT COUNT(*) FROM "users" WHERE "users"."date" = ? AND "users"."bay" = ?  [["date", "2018-08-23"], ["bay", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."date" = ? AND "users"."bay" = ?  [["date", "2018-08-23"], ["bay", 2]]
SELECT COUNT(*) FROM "users" WHERE "users"."date" = ? AND "users"."bay" = ?  [["date", "2018-08-23"], ["bay", 3]]

	def button1
		if User.where(date: Date.today, bay: 1).count == 0
---
SELECT COUNT(*) FROM "users" WHERE "users"."date" = ? AND "users"."bay" = ?  [["date", "2018-08-24"], ["bay", 1]]

	def button2
		if User.where(date: Date.today, bay: 2).count == 0
---
SELECT COUNT(*) FROM "users" WHERE "users"."date" = ? AND "users"."bay" = ?  [["date", "2018-08-24"], ["bay", 2]]

	def button3
		if User.where(date: Date.today, bay: 3).count == 0
---
SELECT COUNT(*) FROM "users" WHERE "users"."date" = ? AND "users"."bay" = ?  [["date", "2020-01-20"], ["bay", 3]]