app/controllers/gifting_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."date" = ? LIMIT ?  [["email", "andrew.tainton@getsmarter.com"], ["date", "2018-08-23"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password", "created_at", "updated_at", "date", "bay") VALUES (?, ?, ?, ?, ?, ?)
---
	def log_user_in
	    #could add a hash function in the line below and then have
		# another hash column in Person model that is a hash of password column
		session[:increase] = false
		session[:redeemed] = false
		@temp = Person.find_by(email: user_params[:email], password: user_params[:password])

		if @temp == nil or !@temp.has_space then
			@error = "Your email or password is incorrect."
			render 'login'
		else
			@user = User.new
			@user.email = @temp.email
			@user.password = @temp.password
			@user.bay = @temp.bay
			@user.date = Date.today
        	if User.find_by(email: @user.email, date: @user.date) == nil then
		 	  @user.save